In [2]:
import pandas as pd
df1=pd.DataFrame({'custID':[1,1,2,2,2,3,3,4,4],
                  'account':[1,2,1,2,3,1,2,1,2],
                  'tenure_mo':[2,3,4,4,5,6,6,6,7],
                 'account_type':['BusiNESS','CONSUMER',
                                'consumer',
                                'BUSINESS',
                                'BuSIness',
                                'CONSUmer',
                                'consumer',
                                'CONSUMER',
                                'BUSINESS']},columns=['custID','account','tenure_mo','account_type'])
print(df1)
df2=pd.DataFrame({'custID':[1,2,3,4],
                 'cust_age':[20,35,50,85]},columns=['custID','cust_age'])
print(df2)

   custID  account  tenure_mo account_type
0       1        1          2     BusiNESS
1       1        2          3     CONSUMER
2       2        1          4     consumer
3       2        2          4     BUSINESS
4       2        3          5     BuSIness
5       3        1          6     CONSUmer
6       3        2          6     consumer
7       4        1          6     CONSUMER
8       4        2          7     BUSINESS
   custID  cust_age
0       1        20
1       2        35
2       3        50
3       4        85

In [4]:
#Exercise Breakout room 1: 
#using pivot tables, write code to display the number of consumer accounts for each customer

In [3]:
#your code goes here..
def num_consumer(x):
    return sum([1 if y.upper()== 'CONSUMER' else 0 for y in x])
df1.pivot_table('account_type',index=['custID'],aggfunc=num_consumer).reset_index().\
rename(columns={'account_type':'Num_consumer_accounts'})

   custID  Num_consumer_accounts
0       1                      1
1       2                      1
2       3                      2
3       4                      1

In [ ]:
#Exercise Breakout room 2: 
#using group by methods (not pivot table), write code to display a list of only those customers that
#have at least 1 business account that are under 50 years of age.

In [6]:
#your code goes here: 
#Step 1: merge the 2
df3 = pd.merge(df1, df2, on = ['custID'])
df3

   custID  account  tenure_mo account_type  cust_age
0       1        1          2     BusiNESS        20
1       1        2          3     CONSUMER        20
2       2        1          4     consumer        35
3       2        2          4     BUSINESS        35
4       2        3          5     BuSIness        35
5       3        1          6     CONSUmer        50
6       3        2          6     consumer        50
7       4        1          6     CONSUMER        85
8       4        2          7     BUSINESS        85

In [40]:
result.drop('custID',axis=1).reset_index().drop('level_1',axis=1)

   custID  account  tenure_mo account_type  cust_age
0       1        1          2     BusiNESS        20
1       1        2          3     CONSUMER        20
2       2        1          4     consumer        35
3       2        2          4     BUSINESS        35
4       2        3          5     BuSIness        35

In [12]:
grouped=df3.groupby('custID')
def segment(df): 
    num_business=sum([1 if y.upper()== 'BUSINESS' else 0 for y in df['account_type']])
    age_ind=1*(df['cust_age'].min()<50)
    print(age_ind)
    if (num_business>0)&(age_ind>0): 
        return df
result=grouped.apply(segment)
print(result)

1
1
0
0
          custID  account  tenure_mo account_type  cust_age
custID
1      0       1        1          2     BusiNESS        20
       1       1        2          3     CONSUMER        20
2      2       2        1          4     consumer        35
       3       2        2          4     BUSINESS        35
       4       2        3          5     BuSIness        35